import React from "react";

const Rules = () => {
  return (
    <div className="m-5">
      <p className="text-lg font-bold mb-4">بسم الله الرحمن الرحيم</p>
      <p className="text-xl mb-4 ">
        الحمد لله رب العالمين، والصلاة والسلام على رسول الله، صلى الله عليه
        وسلم، السلام عليكم ورحمة الله وبركاته. دعماً للشباب ولتقديم لهم علوم
        مختلفة مطلوبة في زماننا هذا لبناء مستقبل إن شاء الله، ودعماً للشباب
        المسلمين فتحنا هذا المشروع لهم وليكون عوناً لهم لطلب العلم، وليكون هذا
        المشروع في ميزان حسناتنا.
      </p>
      <p className="text-lg mb-4">
        في هذا المشروع إن شاء الله فيه 913 دورة في مختلف المجالات، تم استخلاص كل
        هذه الدورات من منصة اليوتيوب، وليكن في علم أصحاب هذه القنوات أن
        المشاهدات تصل إليهم وتزداد دعماً لهم وفي نفس الوقت أجر وثواب وحسنات
        جارية حتى يطلب العلم شبابنا اليوم.
      </p>
      <p className="text-lg mb-4">
        ثواب نشر العلم يتجلى في العديد من الجوانب المهمة التي تعود بالفائدة
        الروحية والدنيوية على المجتمع والفرد على حد سواء.
      </p>
      <p className="text-lg mb-4">
        أولاً، يعتبر نشر العلم وتبادل المعرفة واجبًا دينيًا عظيمًا في الإسلام،
        حيث يشجع الله ورسوله على طلب العلم ونشره وتعليمه للآخرين. ومن هنا يكون
        الفائزون بأجر عظيم لمن يسهم في نشر العلم وتوفير الفرص التعليمية للناس.
      </p>
      <p className="text-lg mb-4">
        ثانيًا، فضل العلم على العابد يأتي من قيمة العلم في إرشاد الناس وتوجيههم
        نحو الخير والحق. فالمعرفة تمكن الإنسان من فهم الأمور بصورة صحيحة،
        وبالتالي تقليل الخطأ والضلال في العقائد والسلوكيات.
      </p>
      <p className="text-lg mb-4">
        وفي النهاية، يجب أن نؤمن بأن كل مساهمة صغيرة في نشر العلم تساهم في بناء
        مجتمع أفضل، وترقيتهم في الدنيا والآخرة بفضل الله تعالى.
      </p>
    </div>
  );
};

export default Rules;
